#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jgarcia-tfg/wordpress_terraform/runs/run-XXPdhW4m1VnhPJVS

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
data.aws_caller_identity.current: Refreshing...
data.aws_iam_policy.beanstalk_health_policy: Refreshing...
data.aws_iam_policy.beanstalk_container_policy: Refreshing...
data.aws_ami.am2: Refreshing...
module.bastion.data.aws_ssm_parameter.this[0]: Refreshing...
data.aws_iam_policy.beanstalk_worker_policy: Refreshing...
data.aws_iam_policy.beanstalk_customer_policy: Refreshing...
module.bastion.data.aws_partition.current: Refreshing...
data.aws_caller_identity.current: Refresh complete after 0s [id=732108167437]
module.bastion.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_iam_policy.beanstalk_webtier_policy: Refreshing...
module.bastion.data.aws_ssm_parameter.this[0]: Refresh complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
data.aws_iam_policy.beanstalk_container_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker]
data.aws_iam_policy.beanstalk_health_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSElasticBeanstalkEnhancedHealth]
data.aws_iam_policy.beanstalk_worker_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier]
data.aws_iam_policy.beanstalk_customer_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/AWSElasticBeanstalkManagedUpdatesCustomerRolePolicy]
data.aws_iam_policy.beanstalk_webtier_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier]
data.aws_ami.am2: Refresh complete after 0s [id=ami-06e46074ae430fba6]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-XXPdhW4m1VnhPJVS/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_instance.wp_instance will be read during apply
  # (config refers to values not yet known)
 <= data "aws_instance" "wp_instance" {
      + ami                         = (known after apply)
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + availability_zone           = (known after apply)
      + credit_specification        = (known after apply)
      + disable_api_stop            = (known after apply)
      + disable_api_termination     = (known after apply)
      + ebs_block_device            = (known after apply)
      + ebs_optimized               = (known after apply)
      + enclave_options             = (known after apply)
      + ephemeral_block_device      = (known after apply)
      + host_id                     = (known after apply)
      + host_resource_group_arn     = (known after apply)
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_state              = (known after apply)
      + instance_tags               = (known after apply)
      + instance_type               = (known after apply)
      + ipv6_addresses              = (known after apply)
      + key_name                    = (known after apply)
      + maintenance_options         = (known after apply)
      + metadata_options            = (known after apply)
      + monitoring                  = (known after apply)
      + network_interface_id        = (known after apply)
      + outpost_arn                 = (known after apply)
      + password_data               = (known after apply)
      + placement_group             = (known after apply)
      + placement_partition_number  = (known after apply)
      + private_dns                 = (known after apply)
      + private_dns_name_options    = (known after apply)
      + private_ip                  = (known after apply)
      + public_dns                  = (known after apply)
      + public_ip                   = (known after apply)
      + root_block_device           = (known after apply)
      + secondary_private_ips       = (known after apply)
      + security_groups             = (known after apply)
      + source_dest_check           = (known after apply)
      + subnet_id                   = (known after apply)
      + tags                        = (known after apply)
      + tenancy                     = (known after apply)
      + user_data                   = (known after apply)
      + user_data_base64            = (known after apply)
      + vpc_security_group_ids      = (known after apply)
    }

  # data.aws_security_group.wp_instance_sg will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "wp_instance_sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # aws_eip.bastion_eip will be created
  + resource "aws_eip" "bastion_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "bastion_eip"
        }
      + tags_all             = {
          + "Name" = "bastion_eip"
        }
      + vpc                  = true
    }

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat-eip"
        }
      + tags_all             = {
          + "Name" = "nat-eip"
        }
      + vpc                  = true
    }

  # aws_eip_association.bastion_eip_assoc will be created
  + resource "aws_eip_association" "bastion_eip_assoc" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_elastic_beanstalk_application.eb_wordpress_app will be created
  + resource "aws_elastic_beanstalk_application" "eb_wordpress_app" {
      + arn         = (known after apply)
      + description = "eb-wordpress-app"
      + id          = (known after apply)
      + name        = "eb-wordpress-app"
      + tags_all    = (known after apply)
    }

  # aws_elastic_beanstalk_environment.eb_wordpress_env will be created
  + resource "aws_elastic_beanstalk_environment" "eb_wordpress_env" {
      + all_settings           = (known after apply)
      + application            = "eb-wordpress-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "eb-wordpress-env"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.5.6 running PHP 8.1"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "wordpress"
        }
      + setting {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + value     = (known after apply)
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      + setting {
          + name      = "LowerThreshold"
          + namespace = "aws:autoscaling:trigger"
          + value     = "30"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "MeasureName"
          + namespace = "aws:autoscaling:trigger"
          + value     = "CPUUtilization"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "ServiceRole"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = (known after apply)
        }
      + setting {
          + name      = "Unit"
          + namespace = "aws:autoscaling:trigger"
          + value     = "Percent"
        }
      + setting {
          + name      = "UpperThreshold"
          + namespace = "aws:autoscaling:trigger"
          + value     = "80"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-0c2fd1aa2cc638f41"
        }
    }

  # aws_iam_instance_profile.beanstalk_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "beanstalk_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "beanstalk-ec2-role"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "beanstalk-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.beanstalk_ec2_role will be created
  + resource "aws_iam_role" "beanstalk_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker",
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier",
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier",
        ]
      + max_session_duration  = 3600
      + name                  = "beanstalk-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.beanstalk_service_role will be created
  + resource "aws_iam_role" "beanstalk_service_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "elasticbeanstalk"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "elasticbeanstalk.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkManagedUpdatesCustomerRolePolicy",
          + "arn:aws:iam::aws:policy/service-role/AWSElasticBeanstalkEnhancedHealth",
        ]
      + max_session_duration  = 3600
      + name                  = "beanstalk-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_key_pair.bastion_key will be created
  + resource "aws_key_pair" "bastion_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "bastion"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDS5+HZEH2oJC8MFzICTvKij2KIib7lqCaIZebRS+e07Ph0qT/r16lUBW4hIe55VxBOEYiBV36g/49n45l/PzWzFBEnUaUvLyfRLqfl+xgShpQNaVA1GU0DmVB25OPHtoiRlqetj2azwn81wGuNrVuH3MDJbhmlHr1qiJ0wnrWqxcFzTdj9qZ9SgJDrhxP7MmZVsZ4V1ay79aO8d7Hb1CDkSrhnMPGN7wPNfqM7i3Qwu2XmVSFSumdiWQxEJVkphbZJ9U5wqGmSNfEA/Tlz5sS5AG1iMcqehsgJGyXeWJwpJwUrsbiQwW9ZKFIJPxKwvxb/420jcZGhegyM06kcH1HOaDBguE0FGu+APcZhH8a4G2hQhiZHznaHqfkte04fP6i7JSLVoMRRPp0wsz+olnl8Y0O8loqHJZGxYi0ot4CBvpidN/tbu3SZyB7VQVw7st3K89KPWzpXqVTdhk48jMsnrSFXbUESZa36ey4hIiihtXFSNK4kV/EHEY66ElkjY4s= jgarcia@CPX-RFK873XJFCY"
      + tags_all        = (known after apply)
    }

  # aws_key_pair.wordpress_key will be created
  + resource "aws_key_pair" "wordpress_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "wordpress"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDDM4/hMg1ngJ5hvemuYHkHmcJdQeh8PMojWpwyub/jEFrhRXuHLGoFw67kTKls8Tl/MB+qrN/QCfNZ8caDdQNtoXY+tWq+vNelOfzhIBKjBL/MNjsI4GXrzvEJpsSs/Hgo3fME6BkjICyvG5IbG+2b9PI8qtRjYWRpUYnaiKNthUTpf/Dqo0KB0toaNU2xFN5ylG1lmdP8/tX+57+muikGvwWBQq/oJ1TQY+zt+/smDm3xoUstE9EIb1pYTrmGFHxc1CYAwzFtfbfaPZru411B1i+Gbbv7SJ9c2iRA62ruS4bSfF00Gyr/EPyrfL0AurtjLph/+5JgJtSlC6xopAZFB8pXDE4Da/1wBm05aunQFb/V5TKa2pPK/l6wqvrw9BhUApfGwxkLtPSdHohoOLX/TUwR3rFm5Iez94At64MfNch7BnBNGVAQUxjWmtLMUtWgQVhdn19EFtAzq15azvj/Yoxg6p94vA29GExz/RQ/87nIoS6t+kBpRnhBRi/n/uM= jgarcia@CPX-RFK873XJFCY"
      + tags_all        = (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "wordpress-nat-gw"
        }
      + tags_all             = {
          + "Name" = "wordpress-nat-gw"
        }
    }

  # aws_route.route will be created
  + resource "aws_route" "route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_rt will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private-rt"
        }
      + tags_all         = {
          + "Name" = "private-rt"
        }
      + vpc_id           = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_route_table_association.private_rt_association["db_1a"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["db_1b"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["db_1c"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["ebec2_1a"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["ebec2_1b"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["ebec2_1c"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["efs_1a"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["efs_1b"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_association["efs_1c"] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_secretsmanager_secret.db_password will be created
  + resource "aws_secretsmanager_secret" "db_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "aurora-db-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.db_password_version will be created
  + resource "aws_secretsmanager_secret_version" "db_password_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "94.73.58.143/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["db_1a"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "db_1a"
        }
      + tags_all                                       = {
          + "Name" = "db_1a"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["db_1b"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "db_1b"
        }
      + tags_all                                       = {
          + "Name" = "db_1b"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["db_1c"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "db_1c"
        }
      + tags_all                                       = {
          + "Name" = "db_1c"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["ebec2_1a"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ebec2_1a"
        }
      + tags_all                                       = {
          + "Name" = "ebec2_1a"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["ebec2_1b"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ebec2_1b"
        }
      + tags_all                                       = {
          + "Name" = "ebec2_1b"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["ebec2_1c"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ebec2_1c"
        }
      + tags_all                                       = {
          + "Name" = "ebec2_1c"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["efs_1a"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "efs_1a"
        }
      + tags_all                                       = {
          + "Name" = "efs_1a"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["efs_1b"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "efs_1b"
        }
      + tags_all                                       = {
          + "Name" = "efs_1b"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.private_subnet["efs_1c"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "efs_1c"
        }
      + tags_all                                       = {
          + "Name" = "efs_1c"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.public_subnet["eblb_1a"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eblb_1a"
        }
      + tags_all                                       = {
          + "Name" = "eblb_1a"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.public_subnet["eblb_1b"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eblb_1b"
        }
      + tags_all                                       = {
          + "Name" = "eblb_1b"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.public_subnet["eblb_1c"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eblb_1c"
        }
      + tags_all                                       = {
          + "Name" = "eblb_1c"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # aws_subnet.public_subnet["public_1a"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public_1a"
        }
      + tags_all                                       = {
          + "Name" = "public_1a"
        }
      + vpc_id                                         = "vpc-0c2fd1aa2cc638f41"
    }

  # module.aurora_db.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.aurora_db.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = false
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 7
      + cluster_identifier              = "wordpress-db"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = "default.aurora-mysql5.7"
      + db_subnet_group_name            = "wordpress-db"
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "5.7"
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + manage_master_user_password     = true
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = (known after apply)
      + network_type                    = (known after apply)
      + port                            = 3306
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags_all                        = (known after apply)
      + vpc_security_group_ids          = (known after apply)

      + timeouts {}
    }

  # module.aurora_db.aws_rds_cluster_instance.this["writer"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = "default.aurora-mysql5.7"
      + db_subnet_group_name                  = "wordpress-db"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "wordpress-db-writer"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.aurora_db.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora wordpress-db"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "wordpress-db-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "wordpress-db"
        }
      + tags_all               = {
          + "Name" = "wordpress-db"
        }
      + vpc_id                 = "vpc-0c2fd1aa2cc638f41"
    }

  # module.aurora_db.aws_security_group_rule.this["ex1_ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.bastion.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Bastion"
        }
      + tags_all                             = {
          + "Name" = "Bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "Bastion"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.efs.aws_efs_backup_policy.this[0] will be created
  + resource "aws_efs_backup_policy" "this" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # module.efs.aws_efs_file_system.this[0] will be created
  + resource "aws_efs_file_system" "this" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "wordpress-efs"
        }
      + tags_all                = {
          + "Name" = "wordpress-efs"
        }
      + throughput_mode         = "bursting"
    }

  # module.efs.aws_efs_mount_target.this["us-east-1a"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["us-east-1b"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["us-east-1c"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "wordpress-efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = true
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c2fd1aa2cc638f41"
    }

  # module.efs.aws_security_group_rule.this["vpc"] will be created
  + resource "aws_security_group_rule" "this" {
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_ip       = (known after apply)
  + eb_instances_ips = (known after apply)

```

</details>

*Pushed by: @jgarciakw, Action: `pull_request`*